using System;


class Program
{
    static void Main()
    {
        /*Напишете програма, която отпечатва три числа в три виртуални колони на конзолата. Всяка колона трябва да е с широчина 
         10 символа, а числата трябва да са ляво подравнени. Първото число трябва да е цяло, в шестнадесетична бройна система, 
         второто да е дробно положително, а третото да е дробно отрицателно. Последните две числа да се закръглят
         до втория знак след десетичната запетая. */

        Console.Write("Число = ");
        int a = int.Parse(Console.ReadLine());
        Console.Write("Положително реално число = ");
        double b = double.Parse(Console.ReadLine());
        Console.Write("Отрицателно реално число = ");
        double c = double.Parse(Console.ReadLine());

        Console.WriteLine("{0,-10:x}{1,-10:f2}{2,-10:f2}", a, b, c);


    }
}

